carpool1.0.2/app/controllers/drivers_controller.rb

SELECT "drivers".* FROM "drivers"
---
  def index
    @drivers = Driver.all

SELECT COUNT(*) FROM "drivers"
INSERT INTO "drivers" ("driverid", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["driverid", 5], ["created_at", "2015-07-03 07:54:55.922100"], ["updated_at", "2015-07-03 07:54:55.922100"]]
---
  def create
    @driver = Driver.new(driver_params)
    i = Driver.count
    @driver.driverid = i+1

    respond_to do |format|
      if @driver.save

UPDATE "drivers" SET "deslat" = $1, "deslong" = $2, "updated_at" = $3 WHERE "drivers"."id" = $4  [["deslat", 33.755787], ["deslong", -116.359998], ["updated_at", "2015-07-02 18:37:05.298380"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @driver.update(driver_params)

DELETE FROM "drivers" WHERE "drivers"."id" = $1  [["id", 1]]
---
  def destroy
    @driver.destroy

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT 1  [["id", 6]]
---
    def set_driver
      @driver = Driver.find(params[:id])