carpool1.0.2/app/controllers/riders_controller.rb

  def index
    @riders = Rider.all
---
SELECT "riders".* FROM "riders"

  def driver_search
    @rider = Rider.new(rider_params)
     require 'pg'
     conn = PGconn.open(:dbname => 'carpool1_0_2_development')
     count = Driver.count
---
SELECT COUNT(*) FROM "drivers"

  def driver_search_google_api
    @rider = Rider.new(rider_params)
     require 'pg'
     conn = PGconn.open(:dbname => 'carpool1_0_2_development')
     count = Driver.count
---
SELECT COUNT(*) FROM "drivers"