carpool1.0.2/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "mobilenumber", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = $1, "mobilenumber" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "d3"], ["mobilenumber", 9876543213], ["updated_at", "2015-07-01 07:20:20.220279"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)